Autodesk.Revit.DB.Analysis.FlowConvergenceCharacteristic
The flow convergence characteristic of the analytical segment cluster.
Since:
2026
Since:
2026

Autodesk.Revit.DB.Analysis.FlowConvergenceCharacteristic.Diverge
The flow is diverged from one segment into multiple paths.

Autodesk.Revit.DB.Analysis.FlowConvergenceCharacteristic.Converge
Multile flow paths are converged into one segment.

Autodesk.Revit.DB.Analysis.FlowConvergenceCharacteristic.Undefined
The flow convergence characteristic is undefined.